[M_FloodingHyperionCity MissionDefinition]
MissionDescription="Moxxi hosted the Underdome Music Competition. Because of his popularity, Jack is very hot.. He found out that Jack [City] was planning to build his own Downing Street in Chicago, which he didn't like - he didn't accept it.. [orin] comes and says to make sure the lower dome isn't built.."

[M_FloodingHyperionCity:KillTheForeman MissionObjectiveDefinition]
ProgressMessage="Kill the boss."
